<?php

/* @var $this yii\web\View */

$this->title = 'Test Task for Startcode';
?>
<div class="site-index">

    <div class="jumbotron">
    </div>

    <div class="body-content">

        <div class="row">
            <div class="col-lg-4">
                <h2>Тестовое задание</h2>

                <p>Необходимо создать веб-приложение для управления базой данных бонусных

                    карт (карты лояльности).

                    Инструменты: нативный PHP или любой PHP фреймворк. Можно использовать

                    jQuery.

                    Список полей: серия карты, номер карты, дата выпуска карты, дата окончания

                    активности карты, дата использования, сумма, статус карты (не

                    активирована/активирована/просрочена).

                    Функционал приложения

                    - список карт с полями: серия, номер, дата выпуска, дата окончания

                    активности, статус

                    - поиск по этим же полям

                    - просмотр профиля карты с историей покупок по ней

                    - активация/деактивация карты

                    - удаление карты

                    - Реализовать генератор карт, с указанием серии и количества генерируемых

                    карт, а также "срок окончания активности" со значениями "1 год", "6 месяцев"

                    "1 месяц". После истечения срока активности карты, у карты проставляется

                    статус "просрочена".

                    Примечание: поля с датами должны содержать также и время.

                    Если не используете фреймворк, то необходимо поддержать методологию

                    MVC.

                    Требуется выслать архив с кодом проекта и дампом базы данных в Skype:

                    starcode.evgenia.oleinikova, либо ссылку для скачивания на почту

                    evgenia.oleinikova@starcode.ru

                    Архив с заданием высылать по e-mail не рекомендуется, т. к. наш спам фильтр

                    может не пропустить письмо с таким аттачем.</p>


            </div>


        </div>

    </div>
</div>
